#+layout: post
#+title: 原子物理 [期末]
#+date: 2023-07-03
#+options: _:nil ^:nil
#+math: true
#+categories: notes
** 电子耦合
+ 电子组态
+ 双电子耦合 (氢原子)

  将多电子的自旋和轨道角动量记作 \(S = (s_1, s_2, s_3, \dots)\) 和 \(L = (l_1, l_2, l_3, \dots)\)
  + \(L-S\) 耦合 \((S, L) = J\)

   #+begin_html
    <details><summary>更加详细的计算</summary>
   #+end_html

    将原子态表示为 \((n_1 l_1 n_2 l_2)^{2s + 1} L_j\),
    于是可以计算得到系统的 \(s = 0, 1\);
    \(l = l_1 + l_2, l_1 + l_2 - 1, \dots, |l_1 - l_2|\);
    \(j = l + s, l + s - 1, \dots, |l - s|\).

    于是应当可以历遍得到原子态符号: \(^{2s+1}L_j\).

   #+begin_html
    <details><summary>计算过程</summary>
   #+end_html

   #+name: L-S-states
   #+begin_src lisp
     (defun L-S-states (l1 s1 l2 s2)
       (let* ((l-1   (sym-l l1))
              (l-2   (sym-l l2))
              (L-lst (loop for l from (+ l-1 l-2) downto (abs (- l-1 l-2)) collect l))
              (S-lst (loop for s from (+ s1 s2) downto 0 collect s))
              (res   '()))
         (loop for s in S-lst do
               (loop for l in L-lst do
                     (loop for j from (+ l s) downto (abs (- l s)) do
                           (push (list (+ 1 (* 2 s)) (l-sym l) j) res))))
         res))
    #+end_src

    #+RESULTS: L-S-states
    : L-S-STATES

    #+name: L-S-states-example
    #+begin_src lisp :exports both :results value raw
      (L-S-states 'p 1/2 'd 1/2)
    #+end_src

    #+RESULTS: L-S-states-example
    ((1 P 1) (1 D 2) (1 F 3) (3 P 0) (3 P 1) (3 P 2) (3 D 1) (3 D 2) (3 D 3)
     (3 F 2) (3 F 3) (3 F 4))

    #+begin_html
    </details></details>
    #+end_html
  + \(j-j\) 耦合 \((s_1 l_1)(s_2 l_2)\dots = (j_1, j_2, j_3, \dots) = J\)

    #+begin_html
    <details><summary>详细的说明和计算步骤</summary>
    #+end_html

    1. 还是一样, 计算得到量子数 \(l, s, j\), 于是可以计算 \(m_j\)
    2. 由于泡利不相容, 所以同样状态的 \(n, l, j, m_j\) 只能有一个

    #+begin_html
    </details>
    #+end_html

  在这样的耦合系统中, 从状态 \((S, L)\) (或者 \(J\)) 变换到状态 \((S', L')\) (或者 \(J'\)),
  应当满足选择规则:
  + \(L-S\) 耦合: \(\Delta S = 0; \Delta L = 0, \pm 1; \Delta J = 0, \pm 1 (J = 0 \not\rightarrow J' = 0)\)
  + \(j-j\) 耦合: \(\Delta j = 0, \pm1; \Delta J = 0, \pm 1(J = 0 \not\rightarrow J' = 0)\)
+ He 原子能级

#+begin_html
<details><summary>习题</summary>
#+end_html

+ 计算对应态的 \(\boldsymbol{L} \cdot \boldsymbol{S}\): (\(\boldsymbol{L} - \boldsymbol{S}\) 耦合)
  1. 得到 \(s, j, l\) (量子态)
  2. 计算 \(S = \sqrt{s(s + 1} \hbar, L = \sqrt{l(l + 1)} \hbar, J = \sqrt{j(j + 1)}\hbar\) (角动量)
  3. 利用耦合关系 \(\boldsymbol{J}^2 = (\boldsymbol{L} + \boldsymbol{S})^2 = \boldsymbol{L}^2 + \boldsymbol{S}^2 + 2 \boldsymbol{L} \cdot \boldsymbol{S}\) 计算
+ 计算可能存在的原子态
  + 考虑 \(L-S\) 耦合: =(L-S-state l1 s1 l2 s2)=,
    并且对于同科电子, 由于泡利原理, 只有 \(l+s\) 为偶数的电子存在.

    #+begin_html
    <details><summary>代码</summary>
    #+end_html

    偶数定则是由于同科电子 (\(n\) 和 \(l\) 都相同的电子引入的限制)
    
    #+begin_src lisp
      (defun even-rule (atom-state)
        "L+S should be even."
        (let ((s (/ (1- (first atom-state)) 2))
              (l (sym-l (second atom-state))))
          (evenp (+ s l))))
    #+end_src

    #+RESULTS:
    : EVEN-RULE

    #+begin_src lisp
      (defun n-l-eq-e-possible-states (l)
        (remove-if-not #'even-rule (L-S-states l 1/2 l 1/2)))
    #+end_src

    #+RESULTS:
    : N-L-EQ-E-POSSIBLE-STATES

    #+begin_src lisp :exports both :results value raw
      (n-l-eq-e-possible-states 'd)
    #+end_src

    #+RESULTS:
    ((1 S 0) (1 D 2) (1 G 4) (3 P 0) (3 P 1) (3 P 2) (3 F 2) (3 F 3) (3 F 4))
    
    #+begin_html
    </details>
    #+end_html
  + 考虑 \(j-j\) 耦合
    
#+begin_html
</details>
#+end_html
** 元素周期表
+ 电子 _壳层_ (\((K, L, M, N, O, P, Q, \dots) \rightarrow (1, 2, \dots)\))
  和 _支壳层_ (\((s, p, d, f, g, h, i, \dots) \rightarrow (0, 1, 2, \dots)\)).
  
  填充原则:
  + 支壳层能够容纳的电子数 \(2(2l + 1)\), 壳层能够容纳的电子数 \(N = \sum 2 (2l + 1) = 2 n^2\).
  + 能量最小 (从低开始填)

    #+begin_html
    <details><summary>壳层次序和洪特定则</summary>
    #+end_html

    *壳层次序*:
    
    填充顺序: \(1s, 2s, 2p, 3s, 3p, 4s, 3d, \dots\) 定性的解释就是对于圆轨道 \(3d\)
    没有轨道贯穿和极化效应, 而 \(4s\) 轨道在径向扭曲, 靠近原子核处拉低了能量.

    #+begin_html
    <details><summary>代码</summary>
    #+end_html

    #+name: electron-shell-next
    #+begin_src lisp
      (defun electron-shell-next (electron)
        "ELECTRON (n . l): (1 . s) -> (2 . s)"
        (let ((n (car electron))
              (l (sym-l (cdr electron))))
          (if (zerop l)                       ; l = s
              (cond ((eq n 1) (cons 2 's))
                    ((eq n 2) (cons 2 'p))
                    ((eq n 3) (cons 3 'p))
                    (T (cons (- n (floor (/ (- n 2) 2))) ; not sure...
                             (l-sym (floor (/ n 2))))))
              (cons (1+ n) (l-sym (1- l))))))
    #+end_src

    #+RESULTS: electron-shell-next
    : ELECTRON-SHELL-NEXT

    #+begin_src lisp :exports both :results value
      (loop for - upto 10
            with electron = (cons 1 's)
            collect electron
            do (setq electron (electron-shell-next electron)))
    #+end_src

    #+RESULTS:
    : ((1 . S) (2 . S) (2 . P) (3 . S) (3 . P) (4 . S) (3 . D) (4 . P) (5 . S) (4 . D) (5 . P))

    #+begin_html
    </details>
    #+end_html

    *洪特定则*:
    1. 给定电子组态, 能量最低的原子态必定具有泡利不相容原理所允许的最大 \(S\) 值.
    2. \(S\) 值相同状态, \(L\) 值最大的原子态能量最低
    3. 对于同科电子 \((nl)^{\nu}\):
       + \(\nu \leq 2 l + 1\), \(J\) 最小的能量最低
       + \(\nu > 2 l + 1\), 超过半满, \(J\) 最大能量最低

    #+begin_html
    <details><summary>例题: 根据 \(Z\) 来确定基态原子态符号</summary>
    #+end_html

    1. 根据 \(Z\) 来确定电子组态

       #+begin_html
       <details><summary>代码</summary>
       #+end_html
       #+begin_src lisp
         (defun electron-shell-of-z (z)
           "Z -> 1s2 2s2 ... (((1 . s) . 2) ((2 . s) . 2) ...)"
           (labels ((n-shell (shell)                 ; shell: (n . l)
                      (let ((l (sym-l (cdr shell)))) ; n-shell = 2(2l + 1)
                        (* 2 (1+ (* 2 l))))))
             (loop with e-shell = (cons 1 's)
                   with counter = 0
                   with res     = '()
                   while (< counter z) do
                     (let ((inc (min (- z counter) (n-shell e-shell))))
                       (push (cons e-shell inc) res)
                       (setq counter (+ counter inc)
                             e-shell (electron-shell-next e-shell)))
                   finally (return (sort res #'< :key #'caar)))))
       #+end_src

       #+RESULTS:
       : ELECTRON-SHELL-OF-Z

       #+begin_src lisp :exports both :results value
         (electron-shell-of-z 26)                ; Fe
       #+end_src

       #+RESULTS:
       : (((1 . S) . 2) ((2 . P) . 6) ((2 . S) . 2) ((3 . D) . 6) ((3 . P) . 6) ((3 . S) . 2) ((4 . S) . 2))

       #+begin_html
       </details>
       #+end_html
    2. 根据洪特定则 (1), 使得 \(S\) 最大

       这个时候就不看那些被排满的电子, 而是看没有被排满的电子. 
    3. 根据洪特定则 (2), 使得 \(L\) 最大 (考虑泡利原理)
    4. 根据洪特定则 (3), 使得 \(J\) 最大

    #+begin_html
    </details>
    #+end_html
    
    #+begin_html
    </details>
    #+end_html
  + 原子实贯穿和极化
 
#+begin_html
<details><summary> 习题 </summary>
#+end_html

+ 计算线系的能量和跃迁的波长
  + 比如已知 \(Z = 45\) 的铑的电子组态 \(1s^2 2s^2 2p^6 3s^2 3p^6 3d^{10} 4s^2 4p^6 4d^8 5s^1\),
    + 计算基态频谱:
      1. 拿到 \(Z\) 可以排电子组态 =(electron-shell-of-z Z)=:

         #+begin_src lisp :exports both :results value
           (electron-shell-of-z 45)
         #+end_src

         #+RESULTS:
         : (((1 . S) . 2) ((2 . P) . 6) ((2 . S) . 2) ((3 . D) . 10) ((3 . P) . 6) ((3 . S) . 2) ((4 . D) . 7) ((4 . P) . 6) ((4 . S) . 2) ((5 . S) . 2))

         Note: 啊, 上面的程序好像是错的... 不过因为没有时间所以就这样吧,
         保留的原因是为了说明程序是有错误的, 不删掉的原因是因为懒.
         (一个简单的猜想是填的时候要么是不满足轨道的选择 =electron-shell-next=,
         要么是我那块的代码写岔了.)
      2. 对于排满的轨道就不考虑了, 直接考虑没有排满的轨道.
         对于题目给的, 没有排满的轨道为 \(4d^8 5s^1\), 于是由洪特定则,
         将 \(S\) 和 \(L\) 填最大未满 (\(s = \frac{3}{2}, l = 3\)), 得到 \(j = l+s = \frac{9}{2}\),
         于是最终的原子态 \(^4F_{9/2}\).

#+begin_html
</details>
#+end_html
